In [1]:
import pandas as pd

In [2]:
#시리즈 만들기
s = {'a':10, 'b':20}
ss = pd.Series(s)
print(ss)

a    10
b    20
dtype: int64

In [3]:
# 기본
ss.value_counts()

20    1
10    1
dtype: int64

In [4]:
ss.unique()

array([10, 20], dtype=int64)

## 데이터 프레임

In [5]:
#데이터 프레임 만들기
df = pd.DataFrame(ss, columns=['p'])

In [6]:
df

    p
a  10
b  20

In [7]:
df.describe()

               p
count   2.000000
mean   15.000000
std     7.071068
min    10.000000
25%    12.500000
50%    15.000000
75%    17.500000
max    20.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   p       2 non-null      int64
dtypes: int64(1)
memory usage: 140.0+ bytes

In [9]:
df.index

Index(['a', 'b'], dtype='object')

In [10]:
df.columns

Index(['p'], dtype='object')

In [11]:
df.values

array([[10],
       [20]], dtype=int64)

In [12]:
df.shape

(2, 1)

In [13]:
df.dtypes

p    int64
dtype: object

In [14]:
df.quantile(0.25) # 1사분위수

p    12.5
Name: 0.25, dtype: float64

## 인덱싱, 슬라이싱

In [15]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [17]:
# 0에서 2행까지 & sepal_length열과 petal_length열 선택
iris.loc[0:2, ['sepal_length','petal_length']]

   sepal_length  petal_length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3

In [18]:
# 0에서 1 (2-1) 까지 행 & 0열과 2열 선택
iris.iloc[0:2, [0,2]]

   sepal_length  petal_length
0           5.1           1.4
1           4.9           1.4

In [19]:
# 0에서 1 (2-1) 까지 행과 열
iris.iloc[0:2, 0:2]

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0

In [29]:
# 조건부 [ ==, !=, >=, >, in , not in 등등]
iris[iris['sepal_length']>5].head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [26]:
# 원하는 것 선택
iris[iris['sepal_length'].isin([5.0,5.1])].head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [27]:
# 두개 이상 조건
iris[(iris['sepal_width']>3) & (iris['species']=='setosa')].head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [28]:
# query함수 사용
iris.query('sepal_length>5').head(2)

iris.query('species == "setosa" and sepal_length in [5.0, 5.1]').head(2)

length=5
iris.query('sepal_length ==@length').head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

## 정렬

In [32]:
# 디폴트 : ascending= True
iris.sort_values(by='sepal_width', ascending=False).head(3)

    sepal_length  sepal_width  petal_length  petal_width species
15           5.7          4.4           1.5          0.4  setosa
33           5.5          4.2           1.4          0.2  setosa
32           5.2          4.1           1.5          0.1  setosa

## apply, lambda 매핑

In [34]:
iris['species'] = iris['species'].apply(lambda x : 1 if x=='setosa' else (2 if x== 'virginica' else 3) )

In [36]:
iris['species'].value_counts()

1    50
2    50
3    50
Name: species, dtype: int64

## 그룹 별 함수 적용

In [37]:
df = sns.load_dataset('titanic')

In [38]:
df.groupby('class')['survived'].agg( lambda x : x.sum()/len(x))

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

## 데이터 프레임 합치기

In [40]:
d1 = pd.DataFrame([[1,2,3], [4,5,6]], columns=list('abc'))
d2 = pd.DataFrame([[11,22,33],[44,55,66]], columns=list('bcd'))

In [41]:
d1

   a  b  c
0  1  2  3
1  4  5  6

In [42]:
d2

    b   c   d
0  11  22  33
1  44  55  66

In [45]:
# concat : 연결, ignore_index=True: 인덱스 순서, join='inner' 공통 열(교집합)
pd.concat([d1,d2],  ignore_index=True, join='inner')

    b   c
0   2   3
1   5   6
2  11  22
3  44  55

In [46]:
# merge : 옆으로 붙이기
pd.merge(s1,s2, on='기준 컬럼명', how='innner')#(공통 열 기준 교집합)
pd.merge(s1,s2, on='기준 컬럼명', how='outer')#(공통 열 기준 합집합)
pd.merge(s1,s2, on='기준 컬럼명', how='left') #(s1 기준으로 s2를 옆에 붙이기)

In [ ]:
#join (merge와 비슷) 행 인덱스를 기준으로 옆으로 결합
df1.join(df2)